In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,2,3,4,5,6,np.nan,8,9,10])

In [3]:
s

0     1.0
1     2.0
2     3.0
3     4.0
4     5.0
5     6.0
6     NaN
7     8.0
8     9.0
9    10.0
dtype: float64

In [5]:
d = pd.date_range('20200301',periods=10)

In [6]:
d

DatetimeIndex(['2020-03-01', '2020-03-02', '2020-03-03', '2020-03-04',
               '2020-03-05', '2020-03-06', '2020-03-07', '2020-03-08',
               '2020-03-09', '2020-03-10'],
              dtype='datetime64[ns]', freq='D')

In [9]:
df = pd.DataFrame(np.random.randn(10,4), index=d, columns=['A','B','C','D'])

In [10]:
df

                   A         B         C         D
2020-03-01 -0.773616  0.768508 -0.255345  0.401371
2020-03-02  0.000924  1.327952  1.690834  0.902132
2020-03-03 -1.971850  0.397425  0.296463  0.938361
2020-03-04  0.961968  1.153540  0.052463  1.500523
2020-03-05  0.126857  0.795016 -1.040520  0.524002
2020-03-06  1.811631  0.548375  1.417244 -0.009383
2020-03-07  1.487630 -0.527226 -0.777425 -0.164613
2020-03-08 -0.110216  1.286409 -1.609466  0.435141
2020-03-09 -2.026620 -1.495445 -2.154738  0.918428
2020-03-10 -2.258946  0.899608  0.555525  1.267823

In [12]:
df = pd.DataFrame({'A':[1,2,3,4],
                  'B':pd.Timestamp(20200301),
                  'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                  'D':np.array([5]*4, dtype='int32'),
                  'E':pd.Categorical(['true','false','True','False']),
                  'F': 'Eduraka'})

In [13]:
df

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [15]:
df.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df.head()

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [17]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [18]:
df.to_numpy()

array([[1, Timestamp('1970-01-01 00:00:00.020200301'), 1.0, 5, 'true',
        'Eduraka'],
       [2, Timestamp('1970-01-01 00:00:00.020200301'), 1.0, 5, 'false',
        'Eduraka'],
       [3, Timestamp('1970-01-01 00:00:00.020200301'), 1.0, 5, 'True',
        'Eduraka'],
       [4, Timestamp('1970-01-01 00:00:00.020200301'), 1.0, 5, 'False',
        'Eduraka']], dtype=object)

In [19]:
df.describe()

              A    C    D
count  4.000000  4.0  4.0
mean   2.500000  1.0  5.0
std    1.290994  0.0  0.0
min    1.000000  1.0  5.0
25%    1.750000  1.0  5.0
50%    2.500000  1.0  5.0
75%    3.250000  1.0  5.0
max    4.000000  1.0  5.0

In [20]:
df.sort_index(axis=1, ascending=False)

         F      E  D    C                             B  A
0  Eduraka   true  5  1.0 1970-01-01 00:00:00.020200301  1
1  Eduraka  false  5  1.0 1970-01-01 00:00:00.020200301  2
2  Eduraka   True  5  1.0 1970-01-01 00:00:00.020200301  3
3  Eduraka  False  5  1.0 1970-01-01 00:00:00.020200301  4

In [23]:
df.sort_values(by='C')

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [24]:
df['C']

0    1.0
1    1.0
2    1.0
3    1.0
Name: C, dtype: float32

In [30]:
df[0:6]

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [33]:
df.loc[:,['A','C']]

   A    C
0  1  1.0
1  2  1.0
2  3  1.0
3  4  1.0

In [36]:
df.iloc[3]

A                                4
B    1970-01-01 00:00:00.020200301
C                                1
D                                5
E                            False
F                          Eduraka
Name: 3, dtype: object

In [37]:
df.iloc[3:5, 0:2]

   A                             B
3  4 1970-01-01 00:00:00.020200301

In [38]:
df[df['A']>0]

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [40]:
df2 = df.reindex(index=d[0:4], columns=list(df.columns)+['E'])

In [43]:
df2

             A   B   C   D    E    F    E
2020-03-01 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-02 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-03 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-04 NaN NaT NaN NaN  NaN  NaN  NaN

In [44]:
df2.isnull()

               A     B     C     D     E     F     E
2020-03-01  True  True  True  True  True  True  True
2020-03-02  True  True  True  True  True  True  True
2020-03-03  True  True  True  True  True  True  True
2020-03-04  True  True  True  True  True  True  True

In [45]:
df2.dropna

<bound method DataFrame.dropna of              A   B   C   D    E    F    E
2020-03-01 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-02 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-03 NaN NaT NaN NaN  NaN  NaN  NaN
2020-03-04 NaN NaT NaN NaN  NaN  NaN  NaN>

In [47]:
pd.isna(df2)

               A     B     C     D     E     F     E
2020-03-01  True  True  True  True  True  True  True
2020-03-02  True  True  True  True  True  True  True
2020-03-03  True  True  True  True  True  True  True
2020-03-04  True  True  True  True  True  True  True

In [48]:
df.mean()

A    2.5
C    1.0
D    5.0
dtype: float64

In [50]:
df.mean(1)

0    2.333333
1    2.666667
2    3.000000
3    3.333333
dtype: float64

In [51]:
s = pd.Series([1,2,3,np.nan, 4,5,6,7,8,9], index=d).shift(2)

In [52]:
s

2020-03-01    NaN
2020-03-02    NaN
2020-03-03    1.0
2020-03-04    2.0
2020-03-05    3.0
2020-03-06    NaN
2020-03-07    4.0
2020-03-08    5.0
2020-03-09    6.0
2020-03-10    7.0
Freq: D, dtype: float64

In [57]:
df

   A                             B    C  D      E        F
0  1 1970-01-01 00:00:00.020200301  1.0  5   true  Eduraka
1  2 1970-01-01 00:00:00.020200301  1.0  5  false  Eduraka
2  3 1970-01-01 00:00:00.020200301  1.0  5   True  Eduraka
3  4 1970-01-01 00:00:00.020200301  1.0  5  False  Eduraka

In [58]:
df.apply(np.cumsum)

,A,B,C,D,E,F
0,1,1970-01-01 00:00:00.020200301,1.0,5,true,Eduraka
1,3,1970-01-01 00:00:00.040400602,2.0,10,truefalse,EdurakaEduraka
2,6,1970-01-01 00:00:00.060600903,3.0,15,truefalseTrue,EdurakaEdurakaEduraka
3,10,1970-01-01 00:00:00.080801204,4.0,20,truefalseTrueFalse,EdurakaEdurakaEdurakaEduraka

In [62]:
s.value_counts()

7.0    1
6.0    1
5.0    1
4.0    1
3.0    1
2.0    1
1.0    1
dtype: int64

In [63]:
s = pd.Series(['Edureka','python','jypyter',np.nan,'football','world'])

In [64]:
s.str.upper()

0     EDUREKA
1      PYTHON
2     JYPYTER
3         NaN
4    FOOTBALL
5       WORLD
dtype: object

In [65]:
df = pd.DataFrame(np.random.randn(10,4))

In [66]:
df2 = [df[:3], df[3:7], df[7:]]

In [67]:
df2

[          0         1         2         3
 0 -1.632360 -0.859880 -0.811286  1.304736
 1  0.667325  1.832993 -0.505304 -0.788344
 2  0.150250 -0.248783  0.746880  0.164791,
           0         1         2         3
 3  0.300623 -0.441066 -0.194864 -2.065388
 4 -0.391899 -0.684138  2.045870 -1.537656
 5  0.063053  0.734068  0.100168 -0.064276
 6  0.007080 -0.978916  0.212380 -1.436603,
           0         1         2         3
 7  1.556308 -1.972514  0.303476 -1.229519
 8 -1.804108 -0.411593 -1.093446  0.194331
 9  0.029601  1.905634  2.107650  0.939229]

In [68]:
pd.concat(df2)

          0         1         2         3
0 -1.632360 -0.859880 -0.811286  1.304736
1  0.667325  1.832993 -0.505304 -0.788344
2  0.150250 -0.248783  0.746880  0.164791
3  0.300623 -0.441066 -0.194864 -2.065388
4 -0.391899 -0.684138  2.045870 -1.537656
5  0.063053  0.734068  0.100168 -0.064276
6  0.007080 -0.978916  0.212380 -1.436603
7  1.556308 -1.972514  0.303476 -1.229519
8 -1.804108 -0.411593 -1.093446  0.194331
9  0.029601  1.905634  2.107650  0.939229

In [69]:
left = pd.DataFrame({'A':[1,2], 'B': [3,4]})

In [75]:
right = pd.DataFrame({'A':[3,2], 'D': [4,5]})

In [76]:
left

   A  B
0  1  3
1  2  4

In [77]:
right

   A  D
0  3  4
1  2  5

In [78]:
pd.merge(left, right, on ='A')

   A  B  D
0  2  4  5

In [79]:
df

          0         1         2         3
0 -1.632360 -0.859880 -0.811286  1.304736
1  0.667325  1.832993 -0.505304 -0.788344
2  0.150250 -0.248783  0.746880  0.164791
3  0.300623 -0.441066 -0.194864 -2.065388
4 -0.391899 -0.684138  2.045870 -1.537656
5  0.063053  0.734068  0.100168 -0.064276
6  0.007080 -0.978916  0.212380 -1.436603
7  1.556308 -1.972514  0.303476 -1.229519
8 -1.804108 -0.411593 -1.093446  0.194331
9  0.029601  1.905634  2.107650  0.939229

In [80]:
df.groupby(2).sum()

                  0         1         3
2
-1.093446 -1.804108 -0.411593  0.194331
-0.811286 -1.632360 -0.859880  1.304736
-0.505304  0.667325  1.832993 -0.788344
-0.194864  0.300623 -0.441066 -2.065388
 0.100168  0.063053  0.734068 -0.064276
 0.212380  0.007080 -0.978916 -1.436603
 0.303476  1.556308 -1.972514 -1.229519
 0.746880  0.150250 -0.248783  0.164791
 2.045870 -0.391899 -0.684138 -1.537656
 2.107650  0.029601  1.905634  0.939229

In [81]:
df.groupby([2,3]).sum()

                            0         1
2         3
-1.093446  0.194331 -1.804108 -0.411593
-0.811286  1.304736 -1.632360 -0.859880
-0.505304 -0.788344  0.667325  1.832993
-0.194864 -2.065388  0.300623 -0.441066
 0.100168 -0.064276  0.063053  0.734068
 0.212380 -1.436603  0.007080 -0.978916
 0.303476 -1.229519  1.556308 -1.972514
 0.746880  0.164791  0.150250 -0.248783
 2.045870 -1.537656 -0.391899 -0.684138
 2.107650  0.939229  0.029601  1.905634

In [83]:
my_tuple = list(zip(*[[1,2,3,4,5,10,11,12,13,14,15,16,17,18,19],[6,7,8,9]]))

In [84]:
index = pd.MultiIndex.from_tuples(my_tuple, names = ['First','Second'])

In [88]:
df = pd.DataFrame(np.random.randn(4,2), index = index, columns=['A','B'])

In [89]:
df2 = df[:4]

In [90]:
df2

                     A         B
First Second
1     6      -1.085075 -0.111405
2     7       0.714671  0.196849
3     8       1.149124 -1.831312
4     9      -2.407093 -0.147707

In [91]:
df2.stack()

First  Second
1      6       A   -1.085075
               B   -0.111405
2      7       A    0.714671
               B    0.196849
3      8       A    1.149124
               B   -1.831312
4      9       A   -2.407093
               B   -0.147707
dtype: float64

In [92]:
df2.unstack()

               A                                       B                      \
Second         6         7         8         9         6         7         8
First
1      -1.085075       NaN       NaN       NaN -0.111405       NaN       NaN
2            NaN  0.714671       NaN       NaN       NaN  0.196849       NaN
3            NaN       NaN  1.149124       NaN       NaN       NaN -1.831312
4            NaN       NaN       NaN -2.407093       NaN       NaN       NaN


Second         9
First
1            NaN
2            NaN
3            NaN
4      -0.147707

In [94]:
df2.stack()

First  Second
1      6       A   -1.085075
               B   -0.111405
2      7       A    0.714671
               B    0.196849
3      8       A    1.149124
               B   -1.831312
4      9       A   -2.407093
               B   -0.147707
dtype: float64

In [95]:
a = df2.stack()

In [96]:
a.unstack()

                     A         B
First Second
1     6      -1.085075 -0.111405
2     7       0.714671  0.196849
3     8       1.149124 -1.831312
4     9      -2.407093 -0.147707

In [97]:
df = pd.DataFrame({'A':['a','b','c','d']*3,
                  'B': ['A','B','C'] *4,
                  'C': ['P','P','P','Q','Q','Q']*2,
                  'D' : np.random.randn(12),
                  'E' : np.random.randn(12)})

In [98]:
df

    A  B  C         D         E
0   a  A  P -1.003948 -0.776040
1   b  B  P  0.741811 -0.254760
2   c  C  P -0.904760  0.777174
3   d  A  Q -0.241145 -1.466053
4   a  B  Q -1.266674 -1.544101
5   b  C  Q -0.518428 -1.575234
6   c  A  P -0.041095 -0.337302
7   d  B  P -1.085963  1.089664
8   a  C  P  1.502085  0.122316
9   b  A  Q  0.326989  0.378046
10  c  B  Q  0.580076 -0.039531
11  d  C  Q  0.536054  0.743326

In [99]:
pd.pivot_table(df, values='D', index=['A','B'], columns = ['C'])

C           P         Q
A B
a A -1.003948       NaN
  B       NaN -1.266674
  C  1.502085       NaN
b A       NaN  0.326989
  B  0.741811       NaN
  C       NaN -0.518428
c A -0.041095       NaN
  B       NaN  0.580076
  C -0.904760       NaN
d A       NaN -0.241145
  B -1.085963       NaN
  C       NaN  0.536054

# TIME SERIES

In [104]:
dates = pd.date_range('3/3/2020', periods = 100, freq='S')

In [105]:
dates

DatetimeIndex(['2020-03-03 00:00:00', '2020-03-03 00:00:01',
               '2020-03-03 00:00:02', '2020-03-03 00:00:03',
               '2020-03-03 00:00:04', '2020-03-03 00:00:05',
               '2020-03-03 00:00:06', '2020-03-03 00:00:07',
               '2020-03-03 00:00:08', '2020-03-03 00:00:09',
               '2020-03-03 00:00:10', '2020-03-03 00:00:11',
               '2020-03-03 00:00:12', '2020-03-03 00:00:13',
               '2020-03-03 00:00:14', '2020-03-03 00:00:15',
               '2020-03-03 00:00:16', '2020-03-03 00:00:17',
               '2020-03-03 00:00:18', '2020-03-03 00:00:19',
               '2020-03-03 00:00:20', '2020-03-03 00:00:21',
               '2020-03-03 00:00:22', '2020-03-03 00:00:23',
               '2020-03-03 00:00:24', '2020-03-03 00:00:25',
               '2020-03-03 00:00:26', '2020-03-03 00:00:27',
               '2020-03-03 00:00:28', '2020-03-03 00:00:29',
               '2020-03-03 00:00:30', '2020-03-03 00:00:31',
               '2020-03-03 00:00:32', '2020-03-03 00:00:33',
               '2020-03-03 00:00:34', '2020-03-03 00:00:35',
               '2020-03-03 00:00:36', '2020-03-03 00:00:37',
               '2020-03-03 00:00:38', '2020-03-03 00:00:39',
               '2020-03-03 00:00:40', '2020-03-03 00:00:41',
               '2020-03-03 00:00:42', '2020-03-03 00:00:43',
               '2020-03-03 00:00:44', '2020-03-03 00:00:45',
               '2020-03-03 00:00:46', '2020-03-03 00:00:47',
               '2020-03-03 00:00:48', '2020-03-03 00:00:49',
               '2020-03-03 00:00:50', '2020-03-03 00:00:51',
               '2020-03-03 00:00:52', '2020-03-03 00:00:53',
               '2020-03-03 00:00:54', '2020-03-03 00:00:55',
               '2020-03-03 00:00:56', '2020-03-03 00:00:57',
               '2020-03-03 00:00:58', '2020-03-03 00:00:59',
               '2020-03-03 00:01:00', '2020-03-03 00:01:01',
               '2020-03-03 00:01:02', '2020-03-03 00:01:03',
               '2020-03-03 00:01:04', '2020-03-03 00:01:05',
               '2020-03-03 00:01:06', '2020-03-03 00:01:07',
               '2020-03-03 00:01:08', '2020-03-03 00:01:09',
               '2020-03-03 00:01:10', '2020-03-03 00:01:11',
               '2020-03-03 00:01:12', '2020-03-03 00:01:13',
               '2020-03-03 00:01:14', '2020-03-03 00:01:15',
               '2020-03-03 00:01:16', '2020-03-03 00:01:17',
               '2020-03-03 00:01:18', '2020-03-03 00:01:19',
               '2020-03-03 00:01:20', '2020-03-03 00:01:21',
               '2020-03-03 00:01:22', '2020-03-03 00:01:23',
               '2020-03-03 00:01:24', '2020-03-03 00:01:25',
               '2020-03-03 00:01:26', '2020-03-03 00:01:27',
               '2020-03-03 00:01:28', '2020-03-03 00:01:29',
               '2020-03-03 00:01:30', '2020-03-03 00:01:31',
               '2020-03-03 00:01:32', '2020-03-03 00:01:33',
               '2020-03-03 00:01:34', '2020-03-03 00:01:35',
               '2020-03-03 00:01:36', '2020-03-03 00:01:37',
               '2020-03-03 00:01:38', '2020-03-03 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [106]:
ts = pd.Series(np.random.randint(0, 500, len(dates)), index=dates)

In [107]:
ts

2020-03-03 00:00:00    177
2020-03-03 00:00:01     45
2020-03-03 00:00:02    428
2020-03-03 00:00:03    307
2020-03-03 00:00:04    327
                      ...
2020-03-03 00:01:35    237
2020-03-03 00:01:36    166
2020-03-03 00:01:37     22
2020-03-03 00:01:38    141
2020-03-03 00:01:39    482
Freq: S, Length: 100, dtype: int32

In [108]:
ts.resample('5min').sum()

2020-03-03    24491
Freq: 5T, dtype: int32

In [109]:
dates = pd.date_range('3/3/2020 00:00', periods = 100, freq='S')

In [110]:
ts = pd.Series(np.random.randn(len(dates)), dates)

In [111]:
ts

2020-03-03 00:00:00   -0.795366
2020-03-03 00:00:01    2.239300
2020-03-03 00:00:02   -0.751635
2020-03-03 00:00:03   -1.306395
2020-03-03 00:00:04    0.633746
                         ...
2020-03-03 00:01:35    0.217595
2020-03-03 00:01:36    0.585567
2020-03-03 00:01:37    2.276456
2020-03-03 00:01:38   -0.108731
2020-03-03 00:01:39    0.423500
Freq: S, Length: 100, dtype: float64

In [112]:
ts_utc = ts.tz_localize('UTC')

In [113]:
ts_utc

2020-03-03 00:00:00+00:00   -0.795366
2020-03-03 00:00:01+00:00    2.239300
2020-03-03 00:00:02+00:00   -0.751635
2020-03-03 00:00:03+00:00   -1.306395
2020-03-03 00:00:04+00:00    0.633746
                               ...
2020-03-03 00:01:35+00:00    0.217595
2020-03-03 00:01:36+00:00    0.585567
2020-03-03 00:01:37+00:00    2.276456
2020-03-03 00:01:38+00:00   -0.108731
2020-03-03 00:01:39+00:00    0.423500
Freq: S, Length: 100, dtype: float64

In [114]:
ts_utc.tz_convert('US/Eastern')

2020-03-02 19:00:00-05:00   -0.795366
2020-03-02 19:00:01-05:00    2.239300
2020-03-02 19:00:02-05:00   -0.751635
2020-03-02 19:00:03-05:00   -1.306395
2020-03-02 19:00:04-05:00    0.633746
                               ...
2020-03-02 19:01:35-05:00    0.217595
2020-03-02 19:01:36-05:00    0.585567
2020-03-02 19:01:37-05:00    2.276456
2020-03-02 19:01:38-05:00   -0.108731
2020-03-02 19:01:39-05:00    0.423500
Freq: S, Length: 100, dtype: float64

In [115]:
dates = pd.date_range('3/3/2020', periods = 5, freq = 'M')

In [116]:
ts = pd.Series(np.random.randn(len(dates)), dates)

In [117]:
ts

2020-03-31    0.878588
2020-04-30   -0.547752
2020-05-31   -1.042067
2020-06-30    1.284060
2020-07-31    1.318007
Freq: M, dtype: float64

In [118]:
ps = ts.to_period()

In [119]:
ps

2020-03    0.878588
2020-04   -0.547752
2020-05   -1.042067
2020-06    1.284060
2020-07    1.318007
Freq: M, dtype: float64

In [121]:
ps.to_timestamp()

2020-03-01    0.878588
2020-04-01   -0.547752
2020-05-01   -1.042067
2020-06-01    1.284060
2020-07-01    1.318007
Freq: MS, dtype: float64

# CATEGORICAL

In [122]:
df = pd.DataFrame({'id':[1,2,3,4,5,6],
                  "grade": ['a','b','c','b','a','e']})

In [123]:
df

   id grade
0   1     a
1   2     b
2   3     c
3   4     b
4   5     a
5   6     e

In [124]:
df['Grade'] = df['grade'].astype("category")

In [125]:
df["Grade"]

0    a
1    b
2    c
3    b
4    a
5    e
Name: Grade, dtype: category
Categories (4, object): [a, b, c, e]

In [127]:
df["Grade"].cat.categories = ['very bad', 'very good', 'excellent','good']